Ran Apply for dir: `.` workspace: `stage`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false \"/atlantis/repos/run0ut/diploma-terraform/7/stage/stage.tfplan\"" in "/atlantis/repos/run0ut/diploma-terraform/7/stage": exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.atlantis_statefulset will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "atlantis_statefulset" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            apiVersion: apps/v1
            kind: StatefulSet
            metadata:
              name: atlantis
            spec:
              serviceName: atlantis
              replicas: 1
              updateStrategy:
                type: RollingUpdate
                rollingUpdate:
                  partition: 0
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
            
                  securityContext:
                    fsGroup: 1000 # Atlantis group (1000) read/write access to volumes.
            
                  initContainers:
                  - name: volume-mount-hack
                    image: busybox
                    command:
                      - sh
                      - "-c"
                      - |
                        chown -R 100:1000 /atlantis
                        cp -r /home/atlantis_temp/. /home/atlantis/
                        chown -R 100:1000 /home/atlantis/
                        chmod 600 /home/atlantis/.ssh/*
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
                    - name: ssh
                      mountPath: /home/atlantis_temp/.ssh/id_rsa
                      subPath: id_rsa
                    - name: ssh-pub
                      mountPath: /home/atlantis_temp/.ssh/id_rsa.pub
                      subPath: id_rsa.pub
                    - name: terraformrc
                      mountPath: /home/atlantis_temp/.terraformrc
                      subPath: .terraformrc
                    - name: auto-tfvars
                      mountPath: /home/atlantis_temp/.auto.tfvars
                      subPath: .auto.tfvars
                    - name: key-json
                      mountPath: /home/atlantis_temp/key.json
                      subPath: key.json
                    - name: server-config
                      mountPath: /home/atlantis_temp/server.yaml
                      subPath: server.yaml
            
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.20.1
                    # command: ["sleep", "360000"]
                    command: ["docker-entrypoint.sh"] 
                    args: 
                      - "server"
                      - "--atlantis-url=http://${atlantis_ip}:30141/"
                      - "--var-file-allowlist=/home/atlantis"
                      - "--tf-download-url=https://terraform-mirror.yandexcloud.net/"
                      - "--repo-config=/home/atlantis/server.yaml"
                      - "--enable-diff-markdown-format"
                    env:
                    - name: ATLANTIS_REPO_ALLOWLIST
                      value: github.com/run0ut/diploma-terraform # 2. Replace this with your own repo allowlist.
                    ### GitHub Config ###
                    - name: ATLANTIS_GH_USER
                      value: run0ut # 3. If you're using GitHub replace <YOUR_GITHUB_USER> with the username of your Atlantis GitHub user without the `@`.
                    - name: ATLANTIS_GH_TOKEN
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: token
                    - name: ATLANTIS_GH_WEBHOOK_SECRET
                      valueFrom:
                        secretKeyRef:
                          name: atlantis-vcs
                          key: webhook-secret
                    ### End GitHub Config ###
                    - name: ATLANTIS_DATA_DIR
                      value: /atlantis
                    - name: ATLANTIS_PORT
                      value: "4141" # Kubernetes sets an ATLANTIS_PORT variable so we need to override.
            
                    volumeMounts:
                    - name: atlantis-data
                      mountPath: /atlantis
                    - name: atlantis-home
                      mountPath: /home/atlantis
            
                    ports:
                    - name: atlantis
                      containerPort: 4141
            
                    resources:
                      requests:
                        memory: 256Mi
                        cpu: 100m
                      limits:
                        memory: 256Mi
                        cpu: 100m
            
                  volumes:
                  - name: atlantis-home
                    emptyDir: { }
                  - name: atlantis-data
                    persistentVolumeClaim:
                      claimName: atlantis-data
                  - name: ssh
                    configMap:
                      name: atlantis-files
                      items: 
                      - key: ssh
                        path: id_rsa
                  - name: ssh-pub
                    configMap:
                      name: atlantis-files
                      items:
                      - key: ssh-pub
                        path: id_rsa.pub
                  - name: terraformrc
                    configMap:
                      name: atlantis-files
                      items:
                      - key: terraformrc
                        path: .terraformrc
                  - name: auto-tfvars
                    configMap:
                      name: atlantis-files
                      items:
                      - key: auto-tfvars
                        path: .auto.tfvars
                  - name: key-json
                    configMap:
                      name: atlantis-files
                      items:
                      - key: key-json
                        path: key.json
                  - name: server-config
                    configMap:
                      name: atlantis-files
                      items:
                      - key: server-config
                        path: server.yaml
        EOT
      + vars     = {
          + "atlantis_ip" = (known after apply)
        }
    }

  # data.template_file.inventory will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "inventory" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [all]
            ${connection_strings_master}
            ${connection_strings_node}
            
            [kube_control_plane]
            ${list_master}
            
            [kube_node]
            ${list_node}
            
            [etcd]
            ${list_master}
            
            [k8s_cluster:children]
            kube_node
            kube_control_plane
        EOT
      + vars     = {
          + "connection_strings_master" = (known after apply)
          + "connection_strings_node"   = (known after apply)
          + "list_master"               = "diploma-control-stage-0"
          + "list_node"                 = "diploma-worker-stage-0"
        }
    }

  # data.template_file.kubectl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "kubectl" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ---
            - name: Get kuber credentials
              hosts: diploma-control-${workspace}-0
              become: yes
              gather_facts: yes
              tasks:
                - name: Save host to var
                  set_fact:
                    kube_control_node: "{{ ansible_host }}"
                - name: Print fact
                  debug:
                    var: kube_control_node
            
                - name: Duplicate folder kube
                  copy:
                    src: /etc/kubernetes/admin.conf
                    dest: /etc/kubernetes/admin_export.conf
                    remote_src: yes
                    mode: 0755
            
                - name: Set Kube IP in config
                  replace:
                    path: /etc/kubernetes/admin_export.conf
                    regexp: "server: https://[0-9.]*:"
                    replace: "server: https://{{ kube_control_node }}:"
                - name: Fetch kube config
                  synchronize:
                    src: /etc/kubernetes/admin_export.conf
                    dest: ../kubeconfig/config-${workspace}
                    delete: yes
                    recursive: yes
                    owner: no
                    group: no
                    mode: pull
        EOT
      + vars     = {
          + "workspace" = "stage"
        }
    }

  # data.template_file.supplementary_addresses_in_ssl_keys will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "supplementary_addresses_in_ssl_keys" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ---
            - name: Allow access by public IP
              hosts: localhost
              become: no
              gather_facts: no
              tasks:
                  - name: Configure option in k8s-cluster.yml
                    replace:
                      path: ../kubespray/inventory/diplomacluster/group_vars/k8s_cluster/k8s-cluster.yml
                      regexp: '^.*supplementary_addresses_in_ssl_keys:.*'
                      replace: "supplementary_addresses_in_ssl_keys: [127.0.0.1, {{ hostvars[\"diploma-control-${workspace}-0\"][\"ansible_host\"] }}]"
        EOT
      + vars     = {
          + "workspace" = "stage"
        }
    }

  # null_resource.app will be created
+ resource "null_resource" "app" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.folder will be created
+ resource "null_resource" "folder" {
      + id = (known after apply)
    }

  # null_resource.git_clone will be created
+ resource "null_resource" "git_clone" {
      + id = (known after apply)
    }

  # null_resource.grafana_public will be created
+ resource "null_resource" "grafana_public" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.inventories will be created
+ resource "null_resource" "inventories" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kube_prometheus will be created
+ resource "null_resource" "kube_prometheus" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kubectl will be created
+ resource "null_resource" "kubectl" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kubectl_playbook will be created
+ resource "null_resource" "kubectl_playbook" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.kubespray will be created
+ resource "null_resource" "kubespray" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.public_access will be created
+ resource "null_resource" "public_access" {
      + id = (known after apply)
    }

  # null_resource.requirements is tainted, so must be replaced
-/+ resource "null_resource" "requirements" {
      ~ id = "7890090048836879595" -> (known after apply)
    }

  # null_resource.supplementary_addresses_in_ssl_keys_playbook will be created
+ resource "null_resource" "supplementary_addresses_in_ssl_keys_playbook" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
      + id = (known after apply)
    }

  # yandex_compute_instance.control[0] must be replaced
-/+ resource "yandex_compute_instance" "control" {
      ~ created_at                = "2022-10-17T07:20:02Z" -> (known after apply)
      ~ folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
      ~ fqdn                      = "diploma-control-stage-0.local" -> (known after apply)
      ~ id                        = "fhmjth9v3ooh1vf3ghai" -> (known after apply)
      - labels                    = {} -> null
        name                      = "diploma-control-stage-0"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
      ~ zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhmnvhtlin4nsbu3mpf1" -> (known after apply)
          ~ disk_id     = "fhmnvhtlin4nsbu3mpf1" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              ~ image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "10.0.0.19" -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:13:ec:53:f1" -> (known after apply)
          ~ nat_ip_address     = "178.154.221.203" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ placement_policy {
          ~ host_affinity_rules = [] -> (known after apply)
          + placement_group_id  = (known after apply)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      ~ scheduling_policy {
          ~ preemptible = false -> (known after apply)
        }
    }

  # yandex_compute_instance.worker[0] must be replaced
-/+ resource "yandex_compute_instance" "worker" {
      ~ created_at                = "2022-10-17T07:20:02Z" -> (known after apply)
      ~ folder_id                 = "b1g01oeuesd31te4bm64" -> (known after apply)
      ~ fqdn                      = "diploma-worker-stage-0.local" -> (known after apply)
      ~ id                        = "fhm4k0osfbetctu1nvek" -> (known after apply)
      - labels                    = {} -> null
        name                      = "diploma-worker-stage-0"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
      ~ zone                      = "ru-central1-a" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhms16l590o6a2sn81hg" -> (known after apply)
          ~ disk_id     = "fhms16l590o6a2sn81hg" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              ~ image_id    = "fd8h059qvtg37ks9ke9o" -> "fd8kb72eo1r5fs97a1ki" # forces replacement
              + name        = (known after apply)
              + snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "10.0.0.11" -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:4a:03:1c:7a" -> (known after apply)
          ~ nat_ip_address     = "178.154.222.48" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ placement_policy {
          ~ host_affinity_rules = [] -> (known after apply)
          + placement_group_id  = (known after apply)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

      ~ scheduling_policy {
          ~ preemptible = false -> (known after apply)
        }
    }

Plan: 15 to add, 0 to change, 3 to destroy.

Changes to Outputs:
~ control_nodes = [
      - "name=diploma-control-stage-0, public=178.154.221.203, private=10.0.0.19",
      + (known after apply),
    ]
~ worker_nodes  = [
      - "name=diploma-worker-stage-0, public=178.154.222.48, private=10.0.0.11",
      + (known after apply),
    ]

null_resource.requirements: Destroying... [id=7890090048836879595]
null_resource.requirements: Destruction complete after 0s
null_resource.git_clone: Creating...
null_resource.git_clone: Provisioning with 'local-exec'...
null_resource.git_clone (local-exec): Executing: ["/bin/sh" "-c" "if [ ! -d 'kubespray' ] ; then git clone https://github.com/kubernetes-sigs/kubespray.git; fi"]
null_resource.git_clone (local-exec): Cloning into 'kubespray'...
yandex_compute_instance.worker[0]: Destroying... [id=fhm4k0osfbetctu1nvek]
yandex_compute_instance.control[0]: Destroying... [id=fhmjth9v3ooh1vf3ghai]
null_resource.git_clone: Still creating... [10s elapsed]
yandex_compute_instance.worker[0]: Still destroying... [id=fhm4k0osfbetctu1nvek, 10s elapsed]
yandex_compute_instance.control[0]: Still destroying... [id=fhmjth9v3ooh1vf3ghai, 10s elapsed]
null_resource.git_clone: Still creating... [20s elapsed]
yandex_compute_instance.worker[0]: Still destroying... [id=fhm4k0osfbetctu1nvek, 20s elapsed]
yandex_compute_instance.control[0]: Still destroying... [id=fhmjth9v3ooh1vf3ghai, 20s elapsed]
yandex_compute_instance.control[0]: Destruction complete after 27s
null_resource.git_clone: Still creating... [30s elapsed]
yandex_compute_instance.worker[0]: Destruction complete after 28s
yandex_compute_instance.worker[0]: Creating...
yandex_compute_instance.control[0]: Creating...
null_resource.git_clone: Still creating... [40s elapsed]
yandex_compute_instance.worker[0]: Still creating... [10s elapsed]
yandex_compute_instance.control[0]: Still creating... [10s elapsed]
null_resource.git_clone: Still creating... [50s elapsed]
yandex_compute_instance.worker[0]: Still creating... [20s elapsed]
yandex_compute_instance.control[0]: Still creating... [20s elapsed]
yandex_compute_instance.worker[0]: Creation complete after 21s [id=fhm8njl3v7kk19sof6eh]
null_resource.git_clone (local-exec): Updating files:  29% (410/1394)
null_resource.git_clone (local-exec): Updating files:  30% (419/1394)
null_resource.git_clone (local-exec): Updating files:  31% (433/1394)
null_resource.git_clone (local-exec): Updating files:  32% (447/1394)
null_resource.git_clone (local-exec): Updating files:  33% (461/1394)
null_resource.git_clone (local-exec): Updating files:  34% (474/1394)
null_resource.git_clone (local-exec): Updating files:  35% (488/1394)
null_resource.git_clone (local-exec): Updating files:  36% (502/1394)
null_resource.git_clone (local-exec): Updating files:  37% (516/1394)
null_resource.git_clone (local-exec): Updating files:  38% (530/1394)
null_resource.git_clone (local-exec): Updating files:  39% (544/1394)
null_resource.git_clone (local-exec): Updating files:  40% (558/1394)
null_resource.git_clone (local-exec): Updating files:  41% (572/1394)
null_resource.git_clone (local-exec): Updating files:  42% (586/1394)
null_resource.git_clone (local-exec): Updating files:  43% (600/1394)
null_resource.git_clone (local-exec): Updating files:  44% (614/1394)
null_resource.git_clone (local-exec): Updating files:  45% (628/1394)
null_resource.git_clone (local-exec): Updating files:  46% (642/1394)
null_resource.git_clone (local-exec): Updating files:  47% (656/1394)
null_resource.git_clone (local-exec): Updating files:  48% (670/1394)
null_resource.git_clone (local-exec): Updating files:  49% (684/1394)
null_resource.git_clone (local-exec): Updating files:  50% (697/1394)
null_resource.git_clone (local-exec): Updating files:  51% (711/1394)
null_resource.git_clone (local-exec): Updating files:  52% (725/1394)
null_resource.git_clone (local-exec): Updating files:  53% (739/1394)
null_resource.git_clone (local-exec): Updating files:  54% (753/1394)
null_resource.git_clone (local-exec): Updating files:  55% (767/1394)
null_resource.git_clone (local-exec): Updating files:  56% (781/1394)
null_resource.git_clone (local-exec): Updating files:  57% (795/1394)
null_resource.git_clone (local-exec): Updating files:  58% (809/1394)
null_resource.git_clone (local-exec): Updating files:  59% (823/1394)
null_resource.git_clone (local-exec): Updating files:  60% (837/1394)
null_resource.git_clone (local-exec): Updating files:  60% (839/1394)
null_resource.git_clone (local-exec): Updating files:  61% (851/1394)
null_resource.git_clone (local-exec): Updating files:  62% (865/1394)
null_resource.git_clone (local-exec): Updating files:  63% (879/1394)
null_resource.git_clone (local-exec): Updating files:  64% (893/1394)
null_resource.git_clone (local-exec): Updating files:  65% (907/1394)
null_resource.git_clone (local-exec): Updating files:  66% (921/1394)
null_resource.git_clone (local-exec): Updating files:  67% (934/1394)
null_resource.git_clone (local-exec): Updating files:  68% (948/1394)
null_resource.git_clone (local-exec): Updating files:  69% (962/1394)
null_resource.git_clone (local-exec): Updating files:  70% (976/1394)
null_resource.git_clone (local-exec): Updating files:  71% (990/1394)
null_resource.git_clone (local-exec): Updating files:  72% (1004/1394)
null_resource.git_clone (local-exec): Updating files:  73% (1018/1394)
null_resource.git_clone (local-exec): Updating files:  74% (1032/1394)
null_resource.git_clone (local-exec): Updating files:  75% (1046/1394)
null_resource.git_clone (local-exec): Updating files:  76% (1060/1394)
null_resource.git_clone (local-exec): Updating files:  77% (1074/1394)
null_resource.git_clone (local-exec): Updating files:  78% (1088/1394)
null_resource.git_clone (local-exec): Updating files:  79% (1102/1394)
null_resource.git_clone (local-exec): Updating files:  80% (1116/1394)
null_resource.git_clone (local-exec): Updating files:  81% (1130/1394)
null_resource.git_clone (local-exec): Updating files:  82% (1144/1394)
null_resource.git_clone (local-exec): Updating files:  82% (1157/1394)
null_resource.git_clone (local-exec): Updating files:  83% (1158/1394)
null_resource.git_clone (local-exec): Updating files:  84% (1171/1394)
null_resource.git_clone (local-exec): Updating files:  85% (1185/1394)
null_resource.git_clone (local-exec): Updating files:  86% (1199/1394)
null_resource.git_clone (local-exec): Updating files:  87% (1213/1394)
null_resource.git_clone (local-exec): Updating files:  88% (1227/1394)
null_resource.git_clone (local-exec): Updating files:  89% (1241/1394)
null_resource.git_clone (local-exec): Updating files:  90% (1255/1394)
null_resource.git_clone (local-exec): Updating files:  91% (1269/1394)
null_resource.git_clone (local-exec): Updating files:  92% (1283/1394)
null_resource.git_clone (local-exec): Updating files:  93% (1297/1394)
null_resource.git_clone (local-exec): Updating files:  94% (1311/1394)
null_resource.git_clone (local-exec): Updating files:  95% (1325/1394)
null_resource.git_clone (local-exec): Updating files:  96% (1339/1394)
null_resource.git_clone (local-exec): Updating files:  97% (1353/1394)
null_resource.git_clone (local-exec): Updating files:  98% (1367/1394)
null_resource.git_clone (local-exec): Updating files:  99% (1381/1394)
null_resource.git_clone (local-exec): Updating files: 100% (1394/1394)
null_resource.git_clone (local-exec): Updating files: 100% (1394/1394), done.
null_resource.git_clone: Creation complete after 58s [id=5609349452753027957]
null_resource.requirements: Creating...
null_resource.requirements: Provisioning with 'local-exec'...
null_resource.requirements (local-exec): Executing: ["/bin/sh" "-c" "pip3 install -r kubespray/requirements.txt"]
yandex_compute_instance.control[0]: Creation complete after 30s [id=fhmppfvove1tps8k6tat]
null_resource.requirements: Still creating... [10s elapsed]
null_resource.requirements (local-exec): Defaulting to user installation because normal site-packages is not writeable
null_resource.requirements (local-exec): Collecting ansible==5.7.1
null_resource.requirements (local-exec):   Downloading ansible-5.7.1.tar.gz (35.7 MB)
null_resource.requirements: Still creating... [20s elapsed]
null_resource.requirements: Still creating... [30s elapsed]
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 35.7/35.7 MB 1.2 MB/s eta 0:00:00
null_resource.requirements: Still creating... [40s elapsed]
null_resource.requirements: Still creating... [50s elapsed]
null_resource.requirements: Still creating... [1m0s elapsed]
null_resource.requirements: Still creating... [1m10s elapsed]
null_resource.requirements: Still creating... [1m20s elapsed]
null_resource.requirements: Still creating... [1m30s elapsed]
null_resource.requirements: Still creating... [1m40s elapsed]
null_resource.requirements: Still creating... [1m50s elapsed]
null_resource.requirements: Still creating... [2m0s elapsed]
null_resource.requirements: Still creating... [2m10s elapsed]
null_resource.requirements: Still creating... [2m20s elapsed]
null_resource.requirements: Still creating... [2m30s elapsed]
null_resource.requirements: Still creating... [2m40s elapsed]
null_resource.requirements: Still creating... [2m50s elapsed]
null_resource.requirements: Still creating... [3m0s elapsed]
null_resource.requirements: Still creating... [3m10s elapsed]
null_resource.requirements: Still creating... [3m20s elapsed]
null_resource.requirements: Still creating... [3m30s elapsed]
null_resource.requirements: Still creating... [3m40s elapsed]
null_resource.requirements: Still creating... [3m50s elapsed]
null_resource.requirements: Still creating... [4m0s elapsed]
null_resource.requirements: Still creating... [4m10s elapsed]
null_resource.requirements: Still creating... [4m20s elapsed]
null_resource.requirements: Still creating... [4m30s elapsed]
null_resource.requirements: Still creating... [4m40s elapsed]
null_resource.requirements: Still creating... [4m50s elapsed]
null_resource.requirements: Still creating... [5m0s elapsed]
null_resource.requirements: Still creating... [5m10s elapsed]
null_resource.requirements: Still creating... [5m20s elapsed]
null_resource.requirements: Still creating... [5m30s elapsed]
null_resource.requirements: Still creating... [5m40s elapsed]
null_resource.requirements: Still creating... [5m50s elapsed]
null_resource.requirements: Still creating... [6m0s elapsed]
null_resource.requirements: Still creating... [6m10s elapsed]
null_resource.requirements: Still creating... [6m20s elapsed]
null_resource.requirements: Still creating... [6m30s elapsed]
null_resource.requirements: Still creating... [6m40s elapsed]
null_resource.requirements: Still creating... [6m50s elapsed]
null_resource.requirements: Still creating... [7m0s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): started
null_resource.requirements: Still creating... [7m10s elapsed]
null_resource.requirements: Still creating... [7m20s elapsed]
null_resource.requirements: Still creating... [7m30s elapsed]
null_resource.requirements: Still creating... [7m40s elapsed]
null_resource.requirements: Still creating... [7m50s elapsed]
null_resource.requirements: Still creating... [8m0s elapsed]
null_resource.requirements: Still creating... [8m10s elapsed]
null_resource.requirements: Still creating... [8m20s elapsed]
null_resource.requirements: Still creating... [8m30s elapsed]
null_resource.requirements: Still creating... [8m40s elapsed]
null_resource.requirements: Still creating... [8m50s elapsed]
null_resource.requirements: Still creating... [9m0s elapsed]
null_resource.requirements: Still creating... [9m10s elapsed]
null_resource.requirements: Still creating... [9m20s elapsed]
null_resource.requirements: Still creating... [9m30s elapsed]
null_resource.requirements: Still creating... [9m40s elapsed]
null_resource.requirements: Still creating... [9m50s elapsed]
null_resource.requirements: Still creating... [10m0s elapsed]
null_resource.requirements: Still creating... [10m10s elapsed]
null_resource.requirements: Still creating... [10m20s elapsed]
null_resource.requirements: Still creating... [10m30s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): still running...
null_resource.requirements: Still creating... [10m40s elapsed]
null_resource.requirements: Still creating... [10m50s elapsed]
null_resource.requirements: Still creating... [11m1s elapsed]
null_resource.requirements: Still creating... [11m11s elapsed]
null_resource.requirements: Still creating... [11m21s elapsed]
null_resource.requirements: Still creating... [11m31s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): still running...
null_resource.requirements (local-exec):   Preparing metadata (setup.py): finished with status 'done'
null_resource.requirements (local-exec): Collecting ansible-core==2.12.5
null_resource.requirements (local-exec):   Downloading ansible-core-2.12.5.tar.gz (7.8 MB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.8/7.8 MB 4.1 MB/s eta 0:00:00
null_resource.requirements: Still creating... [11m41s elapsed]
null_resource.requirements: Still creating... [11m51s elapsed]
null_resource.requirements: Still creating... [12m1s elapsed]
null_resource.requirements: Still creating... [12m11s elapsed]
null_resource.requirements: Still creating... [12m21s elapsed]
null_resource.requirements: Still creating... [12m31s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): started
null_resource.requirements: Still creating... [12m41s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): finished with status 'done'
null_resource.requirements: Still creating... [12m51s elapsed]
null_resource.requirements (local-exec): Collecting cryptography==3.4.8
null_resource.requirements (local-exec):   Downloading cryptography-3.4.8-cp36-abi3-musllinux_1_1_x86_64.whl (3.2 MB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.2/3.2 MB 4.0 MB/s eta 0:00:00
null_resource.requirements (local-exec): Collecting jinja2==2.11.3
null_resource.requirements (local-exec):   Downloading Jinja2-2.11.3-py2.py3-none-any.whl (125 kB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 125.7/125.7 kB 9.5 MB/s eta 0:00:00
null_resource.requirements (local-exec): Collecting netaddr==0.7.19
null_resource.requirements (local-exec):   Downloading netaddr-0.7.19-py2.py3-none-any.whl (1.6 MB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 3.8 MB/s eta 0:00:00
null_resource.requirements (local-exec): Collecting pbr==5.4.4
null_resource.requirements (local-exec):   Downloading pbr-5.4.4-py2.py3-none-any.whl (110 kB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 110.2/110.2 kB 1.0 MB/s eta 0:00:00
null_resource.requirements (local-exec): Collecting jmespath==0.9.5
null_resource.requirements (local-exec):   Downloading jmespath-0.9.5-py2.py3-none-any.whl (24 kB)
null_resource.requirements: Still creating... [13m1s elapsed]
null_resource.requirements (local-exec): Collecting ruamel.yaml==0.16.10
null_resource.requirements (local-exec):   Downloading ruamel.yaml-0.16.10-py2.py3-none-any.whl (111 kB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 111.2/111.2 kB 4.7 MB/s eta 0:00:00
null_resource.requirements (local-exec): Collecting ruamel.yaml.clib==0.2.6
null_resource.requirements (local-exec):   Downloading ruamel.yaml.clib-0.2.6.tar.gz (180 kB)
null_resource.requirements (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 180.7/180.7 kB 2.4 MB/s eta 0:00:00
null_resource.requirements (local-exec):   Preparing metadata (setup.py): started
null_resource.requirements: Still creating... [13m11s elapsed]
null_resource.requirements (local-exec):   Preparing metadata (setup.py): finished with status 'error'
null_resource.requirements (local-exec):   error: subprocess-exited-with-error

null_resource.requirements (local-exec):   × python setup.py egg_info did not run successfully.
null_resource.requirements (local-exec):   │ exit code: 1
null_resource.requirements (local-exec):   ╰─> [3 lines of output]
null_resource.requirements (local-exec):       sys.argv ['/tmp/pip-install-3q6dma5x/ruamel-yaml-clib_7c466b9fc0204498b1293035e8ce7bde/setup.py', 'egg_info', '--egg-base', '/tmp/pip-pip-egg-info-wodics_z']
null_resource.requirements (local-exec):       test compiling /tmp/tmp_ruamel_yw1vpu3_/test_ruamel_yaml.c -> test_ruamel_yaml compile error: /tmp/tmp_ruamel_yw1vpu3_/test_ruamel_yaml.c
null_resource.requirements (local-exec):       Exception: command 'gcc' failed: No such file or directory
null_resource.requirements (local-exec):       [end of output]

null_resource.requirements (local-exec):   note: This error originates from a subprocess, and is likely not a problem with pip.
null_resource.requirements (local-exec): error: metadata-generation-failed

null_resource.requirements (local-exec): × Encountered error while generating package metadata.
null_resource.requirements (local-exec): ╰─> See above for output.

null_resource.requirements (local-exec): note: This is an issue with the package mentioned above, not pip.
null_resource.requirements (local-exec): hint: See above for details.
null_resource.requirements: Still creating... [13m21s elapsed]
null_resource.requirements: Still creating... [13m31s elapsed]
null_resource.requirements: Still creating... [13m41s elapsed]
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.requirements,
│   on 00-prepare.tf line 8, in resource "null_resource" "requirements":
│    8:   provisioner "local-exec" {
│ 
│ Error running command 'pip3 install -r kubespray/requirements.txt': exit
│ status 1. Output: Defaulting to user installation because normal
│ site-packages is not writeable
│ Collecting ansible==5.7.1
│   Downloading ansible-5.7.1.tar.gz (35.7 MB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 35.7/35.7 MB 1.2 MB/s eta 0:00:00
│   Preparing metadata (setup.py): started
│   Preparing metadata (setup.py): still running...
│   Preparing metadata (setup.py): still running...
│   Preparing metadata (setup.py): finished with status 'done'
│ Collecting ansible-core==2.12.5
│   Downloading ansible-core-2.12.5.tar.gz (7.8 MB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.8/7.8 MB 4.1 MB/s eta 0:00:00
│   Preparing metadata (setup.py): started
│   Preparing metadata (setup.py): finished with status 'done'
│ Collecting cryptography==3.4.8
│   Downloading cryptography-3.4.8-cp36-abi3-musllinux_1_1_x86_64.whl (3.2 MB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.2/3.2 MB 4.0 MB/s eta 0:00:00
│ Collecting jinja2==2.11.3
│   Downloading Jinja2-2.11.3-py2.py3-none-any.whl (125 kB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 125.7/125.7 kB 9.5 MB/s eta 0:00:00
│ Collecting netaddr==0.7.19
│   Downloading netaddr-0.7.19-py2.py3-none-any.whl (1.6 MB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 3.8 MB/s eta 0:00:00
│ Collecting pbr==5.4.4
│   Downloading pbr-5.4.4-py2.py3-none-any.whl (110 kB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 110.2/110.2 kB 1.0 MB/s eta 0:00:00
│ Collecting jmespath==0.9.5
│   Downloading jmespath-0.9.5-py2.py3-none-any.whl (24 kB)
│ Collecting ruamel.yaml==0.16.10
│   Downloading ruamel.yaml-0.16.10-py2.py3-none-any.whl (111 kB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 111.2/111.2 kB 4.7 MB/s eta 0:00:00
│ Collecting ruamel.yaml.clib==0.2.6
│   Downloading ruamel.yaml.clib-0.2.6.tar.gz (180 kB)
│      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 180.7/180.7 kB 2.4 MB/s eta 0:00:00
│   Preparing metadata (setup.py): started
│   Preparing metadata (setup.py): finished with status 'error'
│   error: subprocess-exited-with-error
│   
│   × python setup.py egg_info did not run successfully.
│   │ exit code: 1
│   ╰─> [3 lines of output]
│       sys.argv ['/tmp/pip-install-3q6dma5x/ruamel-yaml-clib_7c466b9fc0204498b1293035e8ce7bde/setup.py', 'egg_info', '--egg-base', '/tmp/pip-pip-egg-info-wodics_z']
│       test compiling /tmp/tmp_ruamel_yw1vpu3_/test_ruamel_yaml.c -> test_ruamel_yaml compile error: /tmp/tmp_ruamel_yw1vpu3_/test_ruamel_yaml.c
│       Exception: command 'gcc' failed: No such file or directory
│       [end of output]
│   
│   note: This error originates from a subprocess, and is likely not a problem with pip.
│ error: metadata-generation-failed
│ 
│ × Encountered error while generating package metadata.
│ ╰─> See above for output.
│ 
│ note: This is an issue with the package mentioned above, not pip.
│ hint: See above for details.
│ 
╵

```
</details>

